Renova/src/DataProcessors/ЗагрузкаДокументаРемонт/ЗагрузкаДокументаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДокументаРемонт</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаЗагрузки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Renova/src/Enums/ВидРемонта/ВидРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидРемонта</name>
  <enumValues>
    <name>Предторговый</name>
  </enumValues>
  <enumValues>
    <name>Гарантийный</name>
  </enumValues>
</mdclass:Enum>

Renova/src/Enums/ВидКлиента/ВидКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидКлиента</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Renova/src/Documents/Ремонт/Ремонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Ремонт</name>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>EnumRef.ВидРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПродукции</name>
    <type>
      <types>CatalogRef.МоделиПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКлиента</name>
    <type>
      <types>EnumRef.ВидКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПокупки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНеисправности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНеисправности</name>
    <type>
      <types>CatalogRef.КодыНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРабот</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаВыезд</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДетали</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаРаботы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИтого</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственнаяСмена</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаМодели</name>
    <type>
      <types>CatalogRef.ГруппыМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчет</name>
    <type>
      <types>DocumentRef.ОтчетОРемонтах</types>
    </type>
  </attributes>
</mdclass:Document>

Renova/src/Catalogs/МоделиПродукции/МоделиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиПродукции</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииНоменклатуры</name>
    <type>
      <types>EnumRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>СимвольныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Код7ки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Renova/src/DataProcessors/ЗагрузкаДокументаРемонт/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТабЗнач = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТаблицаЗначений = Объект.ТаблицаЗагрузки.Выгрузить();

	СозданоДокументов = 0;
	// 1. Собираем все уникальные ID для проверки существующих ремонтов
	УникальныеIDДокумента = Новый Массив;
	УникальниеВидыПродукции = Новый Массив;
	УникальныеКодыНеисправностей = Новый Массив;
	УникальнаяНоменклатура = Новый Массив;
	УникальныеIDПродукции = Новый Массив;
	УникальныеПроизводители = Новый Массив;
	УникальныеСмены = Новый Массив;
	
	// Собираем данные с безопасным преобразованием
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл		
		// Для ID документа ремонт
		ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.id);
		Если ЧислоID <> Неопределено Тогда
			Если УникальныеIDДокумента.Найти(ЧислоID) = Неопределено Тогда  
				УникальныеIDДокумента.Добавить(ЧислоID);
			КонецЕсли;
		КонецЕсли;
		
		// Для ID видов продукции
		ЧислоProductID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.product_id);
		Если ЧислоProductID <> Неопределено Тогда
			Если УникальниеВидыПродукции.Найти(ЧислоProductID) = Неопределено Тогда  
				УникальниеВидыПродукции.Добавить(ЧислоProductID);
			КонецЕсли;
		КонецЕсли;
		
		// Для ID кодов неисправностей
		ЧислоCodeID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.code_id);
		Если ЧислоCodeID <> Неопределено Тогда
			Если УникальныеКодыНеисправностей.Найти(ЧислоCodeID) = Неопределено Тогда  
				УникальныеКодыНеисправностей.Добавить(ЧислоCodeID);
			КонецЕсли;
		КонецЕсли;
		
		// Для наименования номенклатуры
		Если ЗначениеЗаполнено(СтрокаДанных.model_description) Тогда
			Если УникальнаяНоменклатура.Найти(СтрокаДанных.model_description) = Неопределено Тогда  
				УникальнаяНоменклатура.Добавить(СтрокаДанных.model_description);
			КонецЕсли;
		КонецЕсли; 
		
		// Для ID кодов продукции
		ЧислоModelID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.model_id);
		Если ЧислоModelID <> Неопределено Тогда
			Если УникальныеIDПродукции.Найти(ЧислоModelID) = Неопределено Тогда  
				УникальныеIDПродукции.Добавить(ЧислоModelID);
			КонецЕсли;
		КонецЕсли;
		// Для Фабрик и смен
		Если ЗначениеЗаполнено(СтрокаДанных.factory) 
			И УникальныеПроизводители.Найти(СтрокаДанных.factory) = Неопределено Тогда
			УникальныеПроизводители.Добавить(СтрокаДанных.factory);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанных.shift) 
			И УникальныеСмены.Найти(СтрокаДанных.shift) = Неопределено Тогда
			УникальныеСмены.Добавить(СтрокаДанных.shift);
		КонецЕсли;
		
	КонецЦикла;	
	
	// 3. Получаем соответствия 
	СоответствиеСуществующегоДокумента = СоответствияСервер.ПолучитьСоответствиеДокументаРемонт(УникальныеIDДокумента);
	СоответствиеВидовПродукции = СоответствияСервер.ПолучитьСоответствиеВидовПродукцииОбщая(УникальниеВидыПродукции);  
	СоответствиеКодовНеисправностей = СоответствияСервер.ПолучитьСоответствиеКодовНеисправностей(УникальныеКодыНеисправностей); 
	СоответствиеНоменклатурыПоНаименованию = СоответствияСервер.ПолучитьСоответствиеНоменклатуры(УникальнаяНоменклатура, Ложь);
	СоответствиеIDПродукции = СоответствияСервер.ПолучитьСоответствиеНоменклатуры(УникальныеIDПродукции); 
	СоответствиеПроизводителей = СоответствияСервер.ПолучитьПроизводитей(УникальныеПроизводители); 
	СоответствиеПроизводственныхСмен =СоответствияСервер.ПолучитьПроизводственныеСмены(УникальныеСмены,УникальныеПроизводители); 
	
	// 5. Создаем документ ремонт
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл
		
		// Получаем числовые ID
		ЧислоIDДокумента = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.id);
		Если ЧислоIDДокумента = Неопределено Тогда
			// Не можем обработать строку без ID
			Продолжить;
		КонецЕсли;
		
		// Проверяем, существует ли уже документ с таким IDСайта
		Если СоответствиеСуществующегоДокумента[ЧислоIDДокумента] <> Неопределено Тогда
			// документ уже существует, пропускаем создание
			Продолжить;			
		КонецЕсли; 
		
		НовыйЭлемент = Документы.Ремонт.СоздатьДокумент();
		//Заполняем номер документа с IDСайта
		НовыйЭлемент.Номер = ЧислоIDДокумента;
		НовыйЭлемент.IDСайта = ЧислоIDДокумента;
		//Заполнение ИД отчета
		Если ЗначениеЗаполнено(СтрокаДанных.report_id) Тогда
			НовыйЭлемент.КодОтчета = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.report_id);
		КонецЕсли;
		
		// Заполнение даты документа
		Если ЗначениеЗаполнено(СтрокаДанных.start_date) Тогда
			НовыйЭлемент.Дата = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.start_date);
		КонецЕсли;
		
		// Заполнение вида ремонта		
		Если СтрокаДанных.work_type = "warranty" Тогда 
			НовыйЭлемент.ВидРемонта = Перечисления.ВидРемонта.Гарантийный;
		Иначе 
			НовыйЭлемент.ВидРемонта = Перечисления.ВидРемонта.Предторговый;
		КонецЕсли; 
		
		// Заполнение видов продукции
		Если ЗначениеЗаполнено(СтрокаДанных.product_id) Тогда 
			ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.product_id);
			Если ЧислоID <> Неопределено Тогда
				СсылкаНаВидПродукции = СоответствиеВидовПродукции[ЧислоID];
				Если СсылкаНаВидПродукции <> Неопределено Тогда
					НовыйЭлемент.ВидПродукции = СсылкаНаВидПродукции;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Серийный номер
		НовыйЭлемент.СерийныйНомер = СтрокаДанных.serial_number;
		
		// Вид клиента
		Если ЗначениеЗаполнено(СтрокаДанных.client_type) Тогда
			Если СтрокаДанных.client_type = "organization" Тогда
				НовыйЭлемент.ВидКлиента = Перечисления.ВидКлиента.ЮридическоеЛицо;	
			Иначе
				НовыйЭлемент.ВидКлиента = Перечисления.ВидКлиента.ФизическоеЛицо;
			КонецЕсли;
		КонецЕсли;
		
		// Личные данные клиента
		НовыйЭлемент.Клиент = СтрокаДанных.client;
		НовыйЭлемент.ТелефонКлиента = СтрокаДанных.client_phone;
		НовыйЭлемент.АдресКлиента = СтрокаДанных.client_addr; 
		
		// Дата покупки 
		Если ЗначениеЗаполнено(СтрокаДанных.buy_date) Тогда
			НовыйЭлемент.ДатаПокупки = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.buy_date);
		КонецЕсли;
		
		// Дата начала ремонта
		Если ЗначениеЗаполнено(СтрокаДанных.start_date) Тогда
			НовыйЭлемент.ДатаНачалаРемонта = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.start_date);
		КонецЕсли; 
		
		// Дата окончания ремонта
		Если ЗначениеЗаполнено(СтрокаДанных.end_date) Тогда
			НовыйЭлемент.ДатаОкончанияРемонта = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.end_date);
		КонецЕсли;
		
		//ДатаПроизводства
		Если ЗначениеЗаполнено(СтрокаДанных.main_date) Тогда
			НовыйЭлемент.ДатаПроизводства = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.main_date);
		КонецЕсли;

		// Описание неисправности
		НовыйЭлемент.ОписаниеНеисправности = СтрокаДанных.problem_description;
		
		// Коды неисправностей
		Если ЗначениеЗаполнено(СтрокаДанных.code_id) Тогда            
			ЧислоID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.code_id);
			Если ЧислоID <> Неопределено Тогда
				СсылкаНаКодНеисправности = СоответствиеКодовНеисправностей[ЧислоID];
				Если СсылкаНаКодНеисправности <> Неопределено Тогда
					НовыйЭлемент.КодНеисправности = СсылкаНаКодНеисправности;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Описание работ
		НовыйЭлемент.ОписаниеРабот = СтрокаДанных.work_description;
		
		// Суммы
		Попытка
			НовыйЭлемент.СуммаЗаВыезд = Число(СтрокаДанных.move_cost);
		Исключение
			НовыйЭлемент.СуммаЗаВыезд = 0;
		КонецПопытки;
		
		Попытка
			НовыйЭлемент.СуммаЗаДетали = Число(СтрокаДанных.parts_cost);
		Исключение
			НовыйЭлемент.СуммаЗаДетали = 0;
		КонецПопытки;
		
		Попытка
			НовыйЭлемент.СуммаЗаРаботы = Число(СтрокаДанных.work_cost);
		Исключение
			НовыйЭлемент.СуммаЗаРаботы = 0;
		КонецПопытки;
		
		Попытка
			НовыйЭлемент.СуммаИтого = Число(СтрокаДанных.total_cost);
		Исключение
			НовыйЭлемент.СуммаИтого = 0;
		КонецПопытки;
		
		// Примечание
		НовыйЭлемент.Примечание = СтрокаДанных.note;
		
		// Проверен		
		ЧислоПроверен = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.verified);		
		Если ЧислоПроверен = 1 Тогда 
			НовыйЭлемент.Проверен = Истина;
		Иначе
			НовыйЭлемент.Проверен = Ложь;
		КонецЕсли;
		
		// Дата производства
		Если ЗначениеЗаполнено(СтрокаДанных.main_date) Тогда
			НовыйЭлемент.ДатаПроизводства = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.main_date); 
		КонецЕсли;
		
		// Дата Проверки
		Если ЗначениеЗаполнено(СтрокаДанных.verified_date) Тогда
			НовыйЭлемент.ДатаПроверки = РаботаСоСтрокойСервер.ПреобразоватьСтрокуВДату(СтрокаДанных.verified_date);
		КонецЕсли;
		
		// Заполнение номенклатуры           
		
		СсылкаНаНаименование = СоответствиеНоменклатурыПоНаименованию[СтрокаДанных.model_description];
		СсылкаНаIDПродукции = Неопределено; 		
		Если СсылкаНаНаименование <> Неопределено Тогда
			НовыйЭлемент.МодельПродукции = СсылкаНаНаименование;
		Иначе
			// Пробуем найти по ID
			Если ЗначениеЗаполнено(СтрокаДанных.model_id) Тогда
				ЧислоModelID = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.model_id);
				Если ЧислоModelID <> Неопределено Тогда
					СсылкаНаIDПродукции = СоответствиеIDПродукции[ЧислоModelID];
					Если СсылкаНаIDПродукции <> Неопределено Тогда
						НовыйЭлемент.МодельПродукции = СсылкаНаIDПродукции;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Создание новой модели, если не найдена ни по наименованию, ни по ID
		Если СсылкаНаНаименование = Неопределено И СсылкаНаIDПродукции = Неопределено Тогда 
			НоваяМодель = Справочники.МоделиПродукции.СоздатьЭлемент();
			НоваяМодель.Наименование = СтрокаДанных.model_description;
			НоваяМодель.Родитель = НовыйЭлемент.ВидПродукции;
			НоваяМодель.Записать();
			СсылкаНаМодель = НоваяМодель.Ссылка;
			
			НовыйЭлемент.МодельПродукции = СсылкаНаМодель;
			
			// Обновляем соответствия
			СоответствиеНоменклатурыПоНаименованию.Вставить(СтрокаДанных.model_description, СсылкаНаМодель);
		КонецЕсли;
		
		// Заполнение производителя (группа справочника)
		Если ЗначениеЗаполнено(СтрокаДанных.factory) Тогда
			НайденныйПроизводитель = СоответствиеПроизводителей[СтрокаДанных.factory];
			Если НайденныйПроизводитель <> Неопределено Тогда
				НовыйЭлемент.Производитель = НайденныйПроизводитель;
			КонецЕсли;
		КонецЕсли;
		
		// Заполнение производственной смены (элемент, подчинённый производителю)
		Если ЗначениеЗаполнено(СтрокаДанных.shift) И ЗначениеЗаполнено(НовыйЭлемент.Производитель) Тогда
		    КлючСмены = СтрокаДанных.factory + "|" + СтрокаДанных.shift;
		    НайденнаяСмена = СоответствиеПроизводственныхСмен[КлючСмены];
		    Если НайденнаяСмена = Неопределено Тогда
		        // Создаём новую смену
		        НоваяСмена = Справочники.ФабрикиИСмены.СоздатьЭлемент();
		        НоваяСмена.СимвольныйКод = СтрокаДанных.shift;
		        НоваяСмена.Родитель = НовыйЭлемент.Производитель;
		        НоваяСмена.Записать();
		        НайденнаяСмена = НоваяСмена.Ссылка;
		        // Добавляем в соответствие для последующих строк
		        СоответствиеПроизводственныхСмен.Вставить(КлючСмены, НайденнаяСмена);
		    КонецЕсли;
		    НовыйЭлемент.ПроизводственнаяСмена = НайденнаяСмена;
		КонецЕсли;
		
		// Заполнение булева проверен
		Если ЗначениеЗаполнено(СтрокаДанных.verified) Тогда
			Если СтрокаДанных.verified = "1" Тогда
				НовыйЭлемент.Проверен = Истина;
			Иначе
				НовыйЭлемент.Проверен = Ложь;
			КонецЕсли;
	    КонецЕсли;
		
		Попытка
			Если НовыйЭлемент.Проверен = Истина Тогда 
				НовыйЭлемент.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НовыйЭлемент.Записать(РежимЗаписиДокумента.Запись);  
			КонецЕсли;  
			
			СозданоДокументов = СозданоДокументов + 1; 
			
			Исключение
			// Логируем ошибку, но продолжаем обработку остальных документов
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при записи документа: " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщенияПользователю = СтрШаблон("Загружено и создано %1 документов ", СозданоДокументов);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);
	
КонецПроцедуры

#КонецОбласти
